# Brewfile
cask_args appdir: "/Applications"

tap "homebrew/cask-fonts"   # Just needed for font casks below

### Packages
## Mac App Store Installer
brew "mas"

## Fundamentals
brew "git"

brew "python3"
## SHELL
brew "zsh"

# Utilities
brew "tmux"
brew "tree"
brew "htop"
brew "ytop"

# FIND
brew "fzf"
brew "ripgrep"
brew "fd"

# NeoVim
brew "neovim"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "node"

# Dev
brew "lazygit" 
brew "lazydocker"

# Window Manager
brew "yabai"
brew "skhd"

### Applications
## Media
cask "calibre"
cask "spotify"
cask "vlc"

## Productivity
cask "google-backup-and-sync"
cask "firefox"
cask "typora"

## Developement
cask "kitty"
cask "alacritty"

### Fonts
cask "font-fira-code"
cask "font-saucecodepro-nerd-font"
