# Brewfile
cask_args appdir: "/Applications"

tap "homebrew/cask-fonts"   # Just needed for font casks below

### Packages
## Mac App Store Installer
brew "mas"

## Fundamentals
brew "git"

brew "python3"
## SHELL
brew "zsh"

# Utilities
brew "tmux"
brew "tree"
brew "htop"
brew "ytop"
brew "pass"

# Task Manager
brew "task"
brew "taskd"

# FIND
brew "fzf"
brew "ripgrep"
brew "fd"

# NeoVim
brew "neovim"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

# Dev
brew "lazygit" 
brew "delta"

### Applications
## Media
cask "calibre"
cask "spotify"
cask "vlc"

## Productivity
cask "google-backup-and-sync"
cask "firefox"
cask "typora"

## Developement
cask "code-insiders"
cask "kitty"

### Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
